Repository: mozilla/spartacus
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: ga_ie, pl

source: Payment cancelled.
ga_ie: Íocaíocht curtha ar ceal.
pl: Anulowano płatność.

source: Cancel
ga_ie: Cealaigh
pl: Anuluj

source: PIN can only contain digits.
ga_ie: Ní cheadaítear ach digití in UAP.
pl: Kod PIN może zawierać tylko cyfry.

source: You logged in as a different user, you must start the payment again.
ga_ie: Bhí tú logáilte isteach mar úsáideoir eile. Ní mór duit an íocaíocht a thosú arís.
pl: Zalogowano jako innego użytkownika, musisz ponownie rozpocząć płatność.

source: Loading
ga_ie: Ag Luchtú
pl: Wczytywanie

source: Beginning payment
ga_ie: Íocaíocht á tosú
pl: Rozpoczęcie płatności

source: Connecting to Persona
ga_ie: Ag ceangal le Persona
pl: Łączenie z usługą Persona

source: Payment complete
ga_ie: Íocaíocht curtha i gcrích
pl: Zakończenie płatności

source: Oops
ga_ie: Úps
pl: Ups

source: This is taking longer than expected. Try again?
ga_ie: Tá moill air seo níos faide ná is gnáth leis. Bain triail eile as?
pl: To trwa dłużej niż oczekiwano. Spróbować ponownie?

source: Something went wrong. Try again?
ga_ie: Tharla earráid. Déan iarracht eile?
pl: Coś poszło źle. Spróbować ponownie?

source: Error
ga_ie: Earráid
pl: Błąd

source: Enter PIN
ga_ie: Cuir UAP isteach
pl: Wprowadź PIN

source: Sign In
ga_ie: Logáil Isteach
pl: Zaloguj

source: Sign in to continue with the payment
ga_ie: Logáil isteach chun dul ar aghaidh leis an íocaíocht
pl: Zaloguj się, by kontynuować płatność

source: Sign in
ga_ie: Logáil isteach
pl: Zaloguj

source: Continue
ga_ie: Lean ar aghaidh
pl: Kontynuuj

source: Wrong PIN
ga_ie: UAP mhícheart
pl: Błędny PIN

source: PINs do not match.
ga_ie: Ní ionann na UAPanna.
pl: Kody PIN nie zgadzają się.

source: Create a PIN
ga_ie: Cruthaigh UAP
pl: Utwórz kod PIN

source: Confirm PIN
ga_ie: Deimhnigh an UAP
pl: Potwierdź kod PIN

source: Reset PIN
ga_ie: Athshocraigh an UAP
pl: Resetuj kod PIN

source: Forgot your PIN?
ga_ie: UAP dearmadta?
pl: Nie pamiętasz swojego kodu PIN?

source: You entered the wrong PIN too many times. Your account is locked. Please try your purchase again in 5 minutes.
ga_ie: Cuireadh do chuntas faoi ghlas toisc go ndearna tú an iomarca iarrachtaí an UAP a chur isteach. Déan iarracht eile do cheannach a chur i gcrích i gceann cúig nóiméid.
pl: Błędny kod PIN wprowadzono zbyt wiele razy. Twoje konto jest zablokowane. Spróbuj ponownie dokonać zakupu za 5 minut.

source: Your PIN was locked
ga_ie: Cuireadh do UAP faoi ghlas
pl: Twój kod PIN został zablokowany

source: Your PIN was locked because you entered it incorrectly too many times. You can continue and try entering your PIN again or reset your PIN.
ga_ie: Cuireadh do UAP faoi ghlas toisc go ndearna tú an iomarca iarrachtaí é a chur isteach. Is féidir leat dul ar aghaidh agus iarracht eile a dhéanamh, nó an UAP a athshocrú.
pl: Twój kod PIN został zablokowany, ponieważ wprowadzono go niepoprawnie zbyt wiele razy. Możesz kontynuować i spróbować wprowadzić swój kod PIN ponownie lub zresetować go.

source: Are you sure you want to reset your PIN? You must sign in to Persona to reset your PIN.
ga_ie: An bhfuil tú cinnte gur mhaith leat do UAP a athshocrú? Caithfidh tú logáil isteach i bPersona chun an UAP a athshocrú.
pl: Czy na pewno chcesz zresetować kod PIN? Musisz zalogować się do usługi Persona, by to zrobić.

source: Verifying payment
ga_ie: Íocaíocht á deimhniú
pl: Weryfikacja płatności

source: Retrying
ga_ie: Iarracht eile á déanamh
pl: Ponowna próba

source: That took longer than expected. Retry?
ga_ie: Bhí moill air sin níos faide ná ba ghnáth leis. Bain triail eile as?
pl: To trwa dłużej niż oczekiwano. Spróbować ponownie?

source: Back
ga_ie: Siar
pl: Powrót

source: Submit
ga_ie: Seol
pl: Prześlij

source: Retry?
ga_ie: Iarracht eile?
pl: Spróbować ponownie?

source: Create PIN
ga_ie: Cruthaigh UAP
pl: Utwórz kod PIN

source: Something went wrong.
ga_ie: Tá rud éigin as fearas.
pl: Coś poszło źle!

source: Reset your PIN?
ga_ie: Athshocraigh d'UAP?
pl: Zresetować kod PIN?

source: Was Locked
ga_ie: Bhí sé faoi ghlas
pl: Zablokowano

source: Setting up payment
ga_ie: Íocaíocht á socrú
pl: Konfiguracja płatności

source: An internal web request timed out.
ga_ie: Chuaigh iarratas inmheánach Gréasáin thar am.
pl: Upłynął limit czasu wewnętrznego zapytania sieciowego.

source: The system timed out while trying to log in.
ga_ie: Chuaigh an córas thar am le linn logála isteach.
pl: Upłynął systemowy limit czasu podczas próby logowania.

source: An error occurred whilst trying to log out.
ga_ie: Tharla earráid le linn logála amach.
pl: Wystąpił błąd podczas próby wylogowania.

source: The system timed out while trying to log out.
ga_ie: Chuaigh an córas thar am le linn logála amach.
pl: Upłynął systemowy limit czasu podczas próby wylogowania.

source: Payments are temporarily disabled.
ga_ie: Ní bheidh íocaíochtaí ar fáil ar feadh tamaill.
pl: Płatności są czasowo niedostępne.

source: An unexpected error occurred when creating your PIN.
ga_ie: Tharla earráid gan súil leis agus do UAP á cruthú.
pl: Wystąpił nieoczekiwany błąd podczas tworzenia kodu PIN.

source: The PIN data submitted was invalid.
ga_ie: Bhí na sonraí UAP neamhbhailí.
pl: Przesłane dane PIN są nieprawidłowe.

source: No valid user found whilst attempting to create your PIN
ga_ie: Níor aimsíodh úsáideoir bailí agus do UAP á cruthú
pl: Nie znaleziono prawidłowego użytkownika podczas tworzenia kodu PIN

source: Permission denied attempting to create your PIN.
ga_ie: Cead diúltaithe agus do UAP á cruthú.
pl: Brak uprawnień do stworzenia kodu PIN.

source: The request timed out whilst attempting to create your PIN.
ga_ie: Chuaigh an t-iarratas thar am agus do UAP á cruthú.
pl: Upłynął limit czas podczas tworzenia kodu PIN.

source: An unexpected error occurred whilst checking your PIN.
ga_ie: Tharla earráid gan súil leis agus do UAP á deimhniú.
pl: Wystąpił niespodziewany błąd podczas sprawdzania kodu PIN.

source: No valid user found whilst checking your PIN
ga_ie: Níor aimsíodh úsáideoir bailí agus do UAP á deimhniú
pl: Nie znaleziono prawidłowego użytkownika podczas sprawdzania kodu PIN

source: Permission denied attempting to check your PIN
ga_ie: Cead diúltaithe agus do UAP á deimhniú
pl: Brak uprawnień do sprawdzenia kodu PIN.

source: The request timed out whilst trying to check your PIN
ga_ie: Chuaigh an t-iarratas thar am agus do UAP á deimhniú
pl: Upłynął limit czas podczas próby sprawdzenia kodu PIN.

source: An unexpected error occurred when resetting your PIN.
ga_ie: Tharla earráid gan súil leis agus do UAP á hathshocrú.
pl: Wystąpił niespodziewany błąd podczas resetowania kodu PIN.

source: No valid user found whilst attempting to reset your PIN
ga_ie: Níor aimsíodh úsáideoir bailí agus do UAP á hathshocrú
pl: Nie znaleziono prawidłowego użytkownika podczas resetowania kodu PIN

source: Permission denied attempting to reset your PIN.
ga_ie: Cead diúltaithe agus do UAP á hathshocrú.
pl: Brak uprawnień do resetowania kodu PIN.

source: The request timed out whilst attempting to reset your PIN.
ga_ie: Chuaigh an t-iarratas thar am agus do UAP á hathshocrú.
pl: Upłynął limit czas podczas próby resetowania kodu PIN.

source: The transaction failed. You have not been charged for this purchase.
ga_ie: Theip ar an idirbheart. Níor baineadh aon airgead as do chuntas.
pl: Transakcja nie powiodła się. Nie obciążono ciebie płatnością za ten zakup.

source: The payment method or price point is not supported for this region or operator.
ga_ie: D'úsáid tú modh íocaíochta nó pointe praghais nach dtacaítear leis sa réigiún seo nó leis an oibreoir seo.
pl: Metoda płatności lub cena bazowa nie jest obsługiwana przez tego operatora lub w tym regionie.

source: Waiting for login
ga_ie: Ag fanacht le logáil isteach
pl: Oczekiwanie na logowanie

source: Retrieving Transaction
ga_ie: Idirbheart á fháil
pl: Pobieranie transakcji

source: An unexpected error occurred.
ga_ie: Tharla earráid gan súil leis.
pl: Wystąpił niespodziewany błąd.

source: Sign-in to reset PIN
ga_ie: Logáil isteach le d'UAP a athshocrú
pl: Zaloguj się, by zresetować kod PIN.

source: Please sign in to reset your PIN.
ga_ie: Logáil isteach le d'UAP a athshocrú
pl: Zaloguj się, by zresetować swój kod PIN.

source: Initializing
ga_ie: Á Thúsú
pl: Inicjowanie

source: PIN Locked
ga_ie: UAP faoi ghlas
pl: Kod PIN został zablokowany

source: Completing payment
ga_ie: Íocaíocht á cur i gcrích
pl: Ukończenie płatności

source: Processing
ga_ie: Á Próiseáil
pl: Przetwarzanie

source: Simulate Payment
ga_ie: Déan Íocaíocht Ionsamhlaithe
pl: Symuluj płatność

source: You will not be charged.
ga_ie: Ní bhainfear aon airgead ó do chuntas.
pl: Nie zostanie obciążony.

source: Reset
ga_ie: Athshocraigh
pl: Resetuj

source: By proceeding you agree to our <a %(terms)s>terms</a> and <a %(privacy)s>Privacy Policy</a>
ga_ie: Má théann tú ar aghaidh, glacann tú leis na <a %(terms)s>téarmaí</a> agus leis an <a %(privacy)s>bPolasaí Príobháideachais</a>
pl: Kontynuując, zgadzasz się z naszą <a %(terms)s>zasadami</a> i <a %(privacy)s>polityką prywatności</a>

source: Connecting to Firefox Accounts
ga_ie: Ag ceangal le Cuntais Firefox
pl: Łączenie z usługą Firefox Accounts

source: Are you sure you want to reset your PIN? You must sign in to Firefox Accounts to reset your PIN.
ga_ie: An bhfuil tú cinnte gur mhaith leat do UAP a athshocrú? Caithfidh tú logáil isteach i do Chuntas Firefox chun an UAP a athshocrú.
pl: Czy na pewno chcesz zresetować kod PIN? Musisz zalogować się do usługi Firefox Accounts, by to zrobić.

source: Logging out
ga_ie: Do do logáil amach
pl: Wylogowywanie

source: You are signed in as:
ga_ie: Tá tú logáilte isteach mar:
pl: Zalogowano jako:

source: Not you?
ga_ie: Ní mise é seo.
pl: To nie ty?

source: Super Simulate
ga_ie: Sár-Ionsamhlúchán
pl: Symuluj

source: Simulate Something?
ga_ie: An bhfuil fonn ort rud éigin a ionsamhlú?
pl: Czy coś symulować?

source: No network simulation
ga_ie: Gan ionsamhlú líonra
pl: Brak symulacji sieciowej

source: PIN too short
ga_ie: UAP róghearr
pl: Kod PIN zbyt krótki

source: Success
ga_ie: D'éirigh linn
pl: Powodzenie

source: Your purchase is complete. Close the window to continue
ga_ie: Tá an íocaíocht críochnaithe. Dún an fhuinneog le leanúint ar aghaidh
pl: Zakup jest sfinalizowany. Zamknij to okno, by kontynuować

source: An error occurred. Close the window to continue
ga_ie: Tharla earráid. Dún an fhuinneog le leanúint ar aghaidh
pl: Wystąpił błąd. Zamknij to okno, by kontynuować

source: Completing Payment
ga_ie: Íocaíocht á cur i gcrích
pl: Ukończenie płatności

source: Product cannot be purchased due to configuration error.
pl: Produkt nie może być zakupiony z powodu błędu konfiguracji.
